/*
1) Напишите программу, где пользователь вводит любое целое положительное число. 
А программа суммирует все числа от 1 до введенного пользователем числа.
*/

// let num = prompt("Введите целое положительное число:")
// let result = 0;

// if (num > 0) {
//   for (let i = 1; i <= num; i++) {
//     result = result + i;
//   }
//   console.log('от 1 до', num,'сумма всех чисел', result)
// } else {
//   alert("Пожалуйста, введите положительное число.");
// }



/*
2) Треугольник в цикле
Напишите цикл, который за 7 вызовов console.log.
*/

// for (let i = 1; i <= 7; i++) {
//     let symbol = '';
//     for (let s = 0; s < i; s++) {
//         symbol = symbol + '#'
//     }
//     console.log(symbol)
// }